Repository: tangyiyong/open_local_ui
Catalog: app/assets/l10n/intl_*.arb
Languages: ar, hi, ja, ko, pt, ru

# abortModelRemovalSnackBar
source: Abort model removal
ar: إلغاء إزالة النموذج
hi: मॉडल हटाने को रद्द करें
ja: モデルの削除をキャンセル
ko: 모델 제거 취소
pt: Cancelar remoção do modelo
ru: Отменить удаление модели

# abortSessionRemovalSnackBar
source: Abort session removal
ar: إلغاء إزالة الجلسة
hi: सत्र हटाने को रद्द करें
ja: セッションの削除をキャンセル
ko: 세션 제거 취소
pt: Cancelar remoção da sessão
ru: Отменить удаление сессии

# aboutPageContributorsTitle
source: Contributors
ar: المساهمون
hi: योगदानकर्ता
ja: 貢献者
ko: 기여자
pt: Contribuidores
ru: Участники

# aboutPageCopyrightNotice
source: Â© 2024 William Karol Di Cioccio
ar: © 2024 ويليام كارول دي تشيوتشيو
hi: © 2024 विलियम कैरोल डी चिउचियो
ja: © 2024 ウィリアム・キャロル・ディ・チウチオ
ko: © 2024 윌리엄 캐롤 디 치우치오
pt: © 2024 William Carol Di Chiuccio
ru: © 2024 Уильям Кэрол Ди Чуччио

# aboutPageDiscoverTitle
source: Discover more
ar: اكتشف المزيد
hi: और जानें
ja: もっと知る
ko: 더 알아보기
pt: Saiba mais
ru: Узнать больше

# aboutPagePoweredByTitle
source: Powered by
ar: مدعوم من
hi: प्रस्तुत किया गया
ja: 提供
ko: 구동
ru: Работает на

# aboutPageSocialButtonContributeTooltip
source: Contribute
ar: ساهم
hi: योगदान करें
ja: 貢献する
ko: 기여하기
pt: Contribua
ru: Сделать вклад

# aboutPageSocialButtonJoinServerTooltip
source: Join server
ar: انضم إلى الخادم
hi: सर्वर में शामिल हों
ja: サーバーに参加する
ko: 서버에 참여하기
pt: Junte-se ao servidor
ru: Присоединиться к серверу

# aboutPageSocialButtonWatchTrailerTooltip
source: Watch trailer
ar: شاهد العرض
hi: ट्रेलर देखें
ja: トレーラーを見る
ko: 예고편 보기
pt: Assista ao trailer
ru: Посмотреть трейлер

# aboutPageVisitProfileTooltip
source: Visit profile
ar: زيارة الملف الشخصي
hi: प्रोफ़ाइल पर जाएं
ja: プロフィールを訪れる
ko: 프로필 방문하기
pt: Visite o perfil
ru: Посетить профиль

# appTitle
source: MyApp
ar: تطبيقي
hi: मेरे एप्लिकेशन
ja: 私のアプリケーション
ko: 내 애플리케이션
pt: Meu Aplicativo
ru: Мое приложение

# attachFilesDialogAllowedFormats
source: Allowed formats: {formats}
ar: التنسيقات المسموح بها: {formats}
hi: अनुमत प्रारूप: {formats}
ja: 許可されている形式: {formats}
ko: 허용되는 형식: {formats}
pt: Formatos permitidos: {formats}
ru: Допустимые форматы: {formats}

# attachFilesDialogBrowseFilesButton
source: Browse files
ar: تصفح الملفات
hi: फाइलें ब्राउज़ करें
ja: ファイルをブラウズ
ko: 파일 찾아보기
pt: Navegar arquivos
ru: Просмотреть файлы

# attachFilesDialogDropFilesText
source: Drop files here
ar: إسقاط الملفات هنا
hi: यहाँ फ़ाइलें छोड़ें
ja: ここにファイルをドロップしてください
ko: 여기에 파일을 드롭하세요
pt: Solte arquivos aqui
ru: Перетащите файлы сюда

# cancelButtonShared
source: Cancel
ar: إلغاء
hi: रद्द करें
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отменить

# chatAttachFilesTooltip
source: Attach files
ar: إرفاق الملفات
hi: फ़ाइल संलग्न करें
ja: ファイルを添付
ko: 파일 첨부
pt: Anexar arquivo
ru: Прикрепить файл

# chatCancelEditButton
source: Cancel editing
ar: إلغاء التعديل
hi: संपादन रद्द करें
ja: 編集をキャンセル
ko: 편집 취소
pt: Cancelar edição
ru: Отменить редактирование

# chatCancelGenerationTooltip
source: Cancel generation
ar: إلغاء التوليد
hi: जनरेशन रद्द करें
ja: 生成をキャンセル
ko: 생성 취소
pt: Cancelar geração
ru: Отменить генерацию

# chatCopyMessageTooltip
source: Copy message
ar: نسخ الرسالة
hi: संदेश कॉपी करें
ja: メッセージをコピー
ko: 메시지 복사
pt: Copiar mensagem
ru: Копировать сообщение

# chatDetachFilesTooltip
source: Detach files
ar: فصل الملفات
hi: फ़ाइलें अलग करें
ja: ファイルを分離
ko: 파일 분리
pt: Desanexar arquivos
ru: Открепить файлы

# chatEditFieldHint
source: Type a message...
ar: أدخل الرسالة...
hi: संदेश दर्ज करें...
ja: メッセージを入力...
ko: 메시지를 입력하세요...
pt: Digite a mensagem...
ru: Введите сообщение...

# chatEditMessageTooltip
source: Edit message
ar: تعديل الرسالة
hi: संदेश संपादित करें
ja: メッセージを編集
ko: 메시지 편집
pt: Editar mensagem
ru: Редактировать сообщение

# chatInputFieldHint
source: Type a message...
ar: أدخل الرسالة...
hi: संदेश दर्ज करें...
ja: メッセージを入力...
ko: 메시지를 입력하세요...
pt: Digite a mensagem...
ru: Введите сообщение...

# chatReadAloudTooltip
source: Read aloud
ar: قراءة بصوت عالٍ
hi: आवाज में पढ़ें
ja: 音声で読み上げる
ko: 소리내어 읽기
pt: Ler em voz alta
ru: Прочитать вслух

# chatRefreshSuggestions
source: Refresh suggestions
ar: تحديث الاقتراحات
hi: सुझाव ताज़ा करें
ja: 提案をリフレッシュ
ko: 제안 새로고침
pt: Atualizar sugestões
ru: Обновить предложения

# chatRegenerateMessageTooltip
source: Regenerate message
ar: إعادة توليد الرسالة
hi: संदेश पुनः उत्पन्न करें
ja: メッセージを再生成
ko: 메시지 재생성
pt: Regenerar mensagem
ru: Регенерировать сообщение

# chatResendMessageButton
source: Resend message
ar: إعادة إرسال الرسالة
hi: संदेश पुनः भेजें
ja: メッセージを再送信
ko: 메시지 다시 보내기
pt: Reenviar mensagem
ru: Повторно отправить сообщение

# chatSendTooltip
source: Send message
ar: إرسال الرسالة
hi: संदेश भेजें
ja: メッセージを送信
ko: 메시지 보내기
pt: Enviar mensagem
ru: Отправить сообщение

# chatStatisticsDuration
source: Duration: {duration} ms
ar: المدة: {duration} مللي ثانية
hi: अवधि: {duration} मिलीसेकंड
ja: 期間: {duration} ミリ秒
ko: 기간: {duration} 밀리초
pt: Duração: {duration} milissegundos
ru: Длительность: {duration} миллисекунд

# chatStatisticsSpeed
source: Speed: {speed} tokens/s
ar: السرعة: {speed} رمز/ثانية
hi: गति: {speed} टोकन/सेकंड
ja: 速度: {speed} トークン/秒
ko: 속도: {speed} 토큰/초
pt: Velocidade: {speed} tokens/segundo
ru: Скорость: {speed} токенов/секунду

# chatStatisticsTokens
source: Tokens: {tokens}
ar: عدد الرموز: {tokens}
hi: टोकन संख्या: {tokens}
ja: トークン数: {tokens}
ko: 토큰 수: {tokens}
pt: Número de tokens: {tokens}
ru: Количество токенов: {tokens}

# chatSuggestionsPrompt
source: Want some suggestions?
ar: هل تحتاج إلى بعض الاقتراحات؟
hi: क्या आपको सुझाव चाहिए?
ja: 提案が必要ですか？
ko: 제안이 필요하신가요?
pt: Você precisa de sugestões?
ru: Нужны предложения?

# chatSystemSender
source: System
ar: النظام
hi: सिस्टम
ja: システム
ko: 시스템
pt: Sistema
ru: Система

# chatTitleEditHint
source: Type a title...
ar: أدخل العنوان...
hi: शीर्षक दर्ज करें...
ja: タイトルを入力...
ko: 제목을 입력하세요...
pt: Digite o título...
ru: Введите название...

# chatToolbarDocsSearchOption
source: Docs search:
ar: بحث في الوثائق:
hi: दस्तावेज़ खोज:
ja: ドキュメント検索:
ko: 문서 검색:
pt: Pesquisar documentos:
ru: Поиск документов:

# chatToolbarModelSelectorHint
source: Select model
ar: اختر النموذج
hi: मॉडल चुनें
ja: モデルを選択
ko: 모델 선택
pt: Selecione o modelo
ru: Выберите модель

# chatToolbarNewSessionButton
source: New session
ar: جلسة جديدة
hi: नई सत्र
ja: 新しいセッション
ko: 새 세션
pt: Nova sessão
ru: Новая сессия

# chatToolbarWebSearchOption
source: Web search:
ar: بحث على الويب:
hi: वेब खोज:
ja: ウェブ検索:
ko: 웹 검색:
pt: Pesquisar na web:
ru: Поиск в интернете:

# chatUserSender
source: You
ar: أنت
hi: मैं
ja: 私
ko: 나
pt: Eu
ru: Я

# chatWelcomeMessage
source: Welcome!
ar: أهلاً بك!
hi: स्वागत है!
ja: ようこそ！
ko: 환영합니다!
pt: Bem-vindo!
ru: Добро пожаловать!

# checkingForUpdatesDialogTitle
source: Checking for updates
ar: التحقق من التحديثات
hi: अपडेट की जाँच कर रहा है
ja: 更新を確認中
ko: 업데이트 확인 중
pt: Verificando atualizações
ru: Проверка обновлений

# closeButtonShared
source: Close
ar: إغلاق
hi: बंद करें
ja: 閉じる
ko: 닫기
pt: Fechar
ru: Закрыть

# codeCopiedSnackBar
source: Code copied to clipboard
ar: تم نسخ الكود إلى الحافظة
hi: कोड क्लिपबोर्ड में कॉपी किया गया
ja: コードがクリップボードにコピーされました
ko: 코드가 클립보드에 복사되었습니다
pt: Código copiado para a área de transferência
ru: Код скопирован в буфер обмена

source: Concurrency Limit
ar: حد التوازي
hi: समानांतरता सीमा
ja: 同時実行制限
ko: 동시성 제한
pt: Limite de concorrência
ru: Ограничение параллельности

# createModelDialogGuideText1
source: Select the model to use:
ar: اختر النموذج الذي تريد استخدامه:
hi: उपयोग करने के लिए मॉडल चुनें:
ja: 使用するモデルを選択してください:
ko: 사용할 모델을 선택하세요:
pt: Escolha um modelo para usar:
ru: Выберите модель для использования:

# createModelDialogGuideText2
source: Enter the name of the model to create:
ar: أدخل اسم النموذج المراد إنشاؤه:
hi: उत्पन्न करने के लिए मॉडल नाम दर्ज करें:
ja: 生成するモデル名を入力してください:
ko: 생성할 모델 이름을 입력하세요:
pt: Digite o nome do modelo a ser gerado:
ru: Введите название создаваемой модели:

# createModelDialogGuideText3
source: Optionally, write a model file:
ar: يمكنك اختيار كتابة ملف نموذج:
hi: मॉडल फ़ाइल चुनें:
ja: モデルファイルを選択できます:
ko: 모델 파일을 작성하려면 선택할 수 있습니다:
pt: Escolha o arquivo do modelo:
ru: Выберите файл модели:

# createModelDialogModelFileHint
source: Enter the model file...
ar: أدخل ملف النموذج...
hi: मॉडल फ़ाइल दर्ज करें...
ja: モデルファイルを入力...
ko: 모델 파일을 입력하세요...
pt: Digite o arquivo do modelo...
ru: Введите файл модели...

# createModelDialogModelFileLabel
source: Model file
ar: ملف النموذج
hi: मॉडल फ़ाइल
ja: モデルファイル
ko: 모델 파일
pt: Arquivo do modelo
ru: Файл модели

# createModelDialogModelNameHint
source: Enter the model name...
ar: أدخل اسم النموذج...
hi: मॉडल नाम दर्ज करें...
ja: モデル名を入力...
ko: 모델 이름을 입력하세요...
pt: Digite o nome do modelo...
ru: Введите название модели...

# createModelDialogModelNameLabel
source: Model name
ar: اسم النموذج
hi: मॉडल नाम
ja: モデル名
ko: 모델 이름
pt: Nome do modelo
ru: Название модели

# createModelDialogModelSelectorHint
source: Select model
ar: اختر النموذج
hi: मॉडल चुनें
ja: モデルを選択
ko: 모델 선택
pt: Selecione o modelo
ru: Выберите модель

# createModelDialogTitle
source: Create model
ar: إنشاء نموذج
hi: मॉडल बनाएं
ja: モデル作成
ko: 모델 생성
pt: Criar modelo
ru: Создать модель

# createdAtTextShared
source: Created at: {createdAt}
ar: تم الإنشاء في: {createdAt}
hi: निर्माण तिथि: {createdAt}
ja: 作成日: {createdAt}
ko: 생성 날짜: {createdAt}
pt: Data de criação: {createdAt}
ru: Дата создания: {createdAt}

# dashboardAboutButton
source: About
ar: حول
hi: जानकारी
ja: 情報
ko: 정보
pt: Sobre
ru: О программе

# dashboardChatButton
source: Chat
ar: الدردشة
hi: चैट
ja: チャット
ko: 채팅
ru: Чат

# dashboardHomeButton
source: Home
ar: الصفحة الرئيسية
hi: होम
ja: ホーム
ko: 홈
pt: Início
ru: Главная

# dashboardModelsButton
source: Models
ar: النماذج
hi: मॉडल
ja: モデル
ko: 모델
pt: Modelos
ru: Модели

# dashboardSessionsButton
source: Sessions
ar: الجلسات
hi: सत्र
ja: セッション
ko: 세션
pt: Sessões
ru: Сессии

# dashboardSettingsButton
source: Settings
ar: الإعدادات
hi: सेटिंग
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки

# dialogAttachButton
source: Attach
ar: إرفاق
hi: संलग्न करें
ja: 添付
ko: 첨부
pt: Anexar
ru: Прикрепить

# dialogCancelButtonShared
source: Cancel
ar: إلغاء
hi: रद्द करें
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отменить

# dialogCloseButtonShared
source: Close
ar: إغلاق
hi: बंद करें
ja: 閉じる
ko: 닫기
pt: Fechar
ru: Закрыть

# dialogConfirmButtonShared
source: Confirm
ar: تأكيد
hi: पुष्ट करें
ja: 確認
ko: 확인
pt: Confirmar
ru: Подтвердить

# dialogContinueInBackgroundButtonShared
source: Continue in background
ar: الاستمرار في الخلفية
hi: पृष्ठभूमि में जारी रखें
ja: バックグラウンドで続ける
ko: 백그라운드에서 계속
pt: Continuar em segundo plano
ru: Продолжить в фоновом режиме

# dialogCreateButtonShared
source: Create
ar: إنشاء
hi: बनाएँ
ja: 作成
ko: 생성
pt: Criar
ru: Создать

# dialogRemoveButton
source: Remove
ar: إزالة
hi: हटाएँ
ja: 削除
ko: 제거
pt: Remover
ru: Удалить

# dialogSkipButton
source: Skip
ar: تخطى
hi: छोड़ें
ja: スキップ
ko: 건너뛰기
pt: Pular
ru: Пропустить

# dialogStartButtonShared
source: Start
ar: بدء
hi: शुरू करें
ja: 開始
ko: 시작
pt: Iniciar
ru: Начать

# dialogUpdateButton
source: Update
ar: تحديث
hi: अद्यतन करें
ja: 更新
ko: 업데이트
pt: Atualizar
ru: Обновить

# enableDocsSearch
source: Docs Search
ar: بحث في الوثائق
hi: दस्तावेज़ खोज सक्षम करें
ja: ドキュメント検索
ko: 문서 검색
pt: Habilitar pesquisa de documentos
ru: Включить поиск по документам

# enableWebSearch
source: Web Search
ar: بحث على الويب
hi: वेब खोज सक्षम करें
ja: ウェブ検索
ko: 웹 검색
pt: Habilitar pesquisa na web
ru: Включить поиск в интернете

# failedToCreateFolderSnackBar
source: Failed to create folder
ar: فشل في إنشاء المجلد
hi: फोल्डर बनाने में असफल
ja: フォルダーの作成に失敗しました
ko: 폴더 생성 실패
pt: Falha ao criar pasta
ru: Не удалось создать папку

# failedToCreateModelSnackBar
source: Failed to create model
ar: فشل في إنشاء النموذج
hi: मॉडल बनाने में असफल
ja: モデルの作成に失敗しました
ko: 모델 생성 실패
pt: Falha ao criar modelo
ru: Не удалось создать модель

# failedToPullModelSnackBar
source: Failed to pull model
ar: فشل في سحب النموذج
hi: मॉडल खींचने में असफल
ja: モデルの取得に失敗しました
ko: 모델 가져오기 실패
pt: Falha ao puxar modelo
ru: Не удалось получить модель

# failedToPushModelSnackBar
source: Failed to push model
ar: فشل في دفع النموذج
hi: मॉडल को पुश करने में असफल
ja: モデルのプッシュに失敗しました
ko: 모델 푸시 실패
pt: Falha ao enviar modelo
ru: Не удалось отправить модель

# failedToShareSessionSnackBar
source: Failed to share session
ar: فشل في مشاركة الجلسة
hi: सत्र साझा करने में असफल
ja: セッションの共有に失敗しました
ko: 세션 공유 실패
pt: Falha ao compartilhar sessão
ru: Не удалось поделиться сессией

# feedbackButton
source: Feedback
ar: التغذية الراجعة
hi: प्रतिपुष्टि
ja: フィードバック
ko: 피드백
ru: Обратная связь

# folderCreatedSnackBar
source: Folder created
ar: تم إنشاء المجلد
hi: फोल्डर बनाया गया
ja: フォルダーが作成されました
ko: 폴더가 생성되었습니다
pt: Pasta criada
ru: Папка создана

source: Frequency Penalty
ar: عقوبة التكرار
hi: आवृत्ति दंड
ja: 頻度ペナルティ
ko: 빈도 페널티
pt: Penalidade de frequência
ru: Штраф за частоту

# importModelDialogTitle
source: Import model
ar: استيراد نموذج
hi: मॉडल आयात करें
ja: モデルのインポート
ko: 모델 가져오기
pt: Importar modelo
ru: Импортировать модель

source: Keep Alive
ar: الحفاظ على الاتصال
hi: कनेक्शन बनाए रखें
ja: 接続を維持
ko: 활성 상태 유지
pt: Manter conexão
ru: Поддерживать соединение

# licenseButton
source: License
ar: الترخيص
hi: लाइसेंस
ja: ライセンス
ko: 라이선스
pt: Licença
ru: Лицензия

# listFiltersSortByLabel
source: Sort by
ar: الترتيب حسب
hi: छंटाई मानदंड
ja: ソート基準
ko: 정렬 기준
pt: Critério de ordenação
ru: Критерий сортировки

# listFiltersSortOrderLabel
source: In order
ar: الترتيب
hi: छंटाई क्रम
ja: ソート順
ko: 정렬 순서
pt: Ordem de ordenação
ru: Порядок сортировки

source: Logits All
ar: كافة Logits
hi: सभी लॉजिट्स
ja: すべてのロジット
ko: 모든 로그리츠
pt: Todos os logits
ru: Все логиты

source: Low VRAM
ar: ذاكرة VRAM منخفضة
hi: निम्न VRAM
ja: 低VRAM
ko: 낮은 VRAM
pt: VRAM baixa
ru: Низкая VRAM

source: Main GPU
ar: معالج الرسومات الرئيسي
hi: मुख्य GPU
ja: メインGPU
ko: 주 GPU
pt: GPU principal
ru: Основная GPU

# markdownCopyTooltip
source: Copy markdown
ar: نسخ Markdown
hi: मार्कडाउन कॉपी करें
ja: Markdownをコピー
ko: Markdown 복사
pt: Copiar markdown
ru: Скопировать markdown

# markdownLanguageLabel
source: Language: {language}
ar: اللغة: {language}
hi: भाषा: {language}
ja: 言語: {language}
ko: 언어: {language}
pt: Idioma: {language}
ru: Язык: {language}

# messageCopiedSnackBar
source: Message copied to clipboard
ar: تم نسخ الرسالة إلى الحافظة
hi: संदेश क्लिपबोर्ड में कॉपी किया गया
ja: メッセージがクリップボードにコピーされました
ko: 메시지가 클립보드에 복사되었습니다
pt: Mensagem copiada para a área de transferência
ru: Сообщение скопировано в буфер обмена

# mirostat
source: Microstat
ar: ميكروستات
hi: मायरोस्टैट
ja: ミロスタット
ko: 미로스탯
pt: Mirostat
ru: Миростат

# mirostatEta
source: Microstat ETA
ar: ميكروستات ETA
hi: मायरोस्टैट ईटीए
ja: ミロスタットETA
ko: 미로스탯 ETA
pt: Mirostat ETA
ru: ETA миростата

# mirostatTau
source: Microstat TAU
ar: ميكروستات TAU
hi: मायरोस्टैट टौ
ja: ミロスタットTAU
ko: 미로스탯 TAU
pt: Mirostat Tau
ru: Тау миростата

# modelCreatedSuccessfullySnackBar
source: Model created successfully
ar: تم إنشاء النموذج بنجاح
hi: मॉडल सफलतापूर्वक बनाया गया
ja: モデルが正常に作成されました
ko: 모델이 성공적으로 생성되었습니다
pt: Modelo criado com sucesso
ru: Модель успешно создана

# modelDetailsDigestText
source: Digest: {digest}
ar: الملخص: {digest}
hi: डाइजेस्ट: {digest}
ja: ダイジェスト: {digest}
ko: 다이제스트: {digest}
ru: Сводка: {digest}

# modelDetailsFamilyText
source: Family: {family}
ar: العائلة: {family}
hi: परिवार: {family}
ja: ファミリー: {family}
ko: 가족: {family}
pt: Família: {family}
ru: Семейство: {family}

# modelDetailsFormatText
source: Format: {format}
ar: الصيغة: {format}
hi: प्रारूप: {format}
ja: 形式: {format}
ko: 형식: {format}
pt: Formato: {format}
ru: Формат: {format}

# modelDetailsParametersSizeText
source: Parameters: {parametersSize} B
ar: المعلمات: {parametersSize} ب
hi: पैरामीटर आकार: {parametersSize} बी
ja: パラメーターサイズ: {parametersSize} B
ko: 매개변수 크기: {parametersSize} B
pt: Tamanho dos parâmetros: {parametersSize} B
ru: Размер параметров: {parametersSize} B

# modelDetailsQuantizationLevelText
source: Quantization: {quantizationLevel}
ar: التكميم: {quantizationLevel}
hi: क्वांटाइजेशन स्तर: {quantizationLevel}
ja: 量子化レベル: {quantizationLevel}
ko: 양자화 수준: {quantizationLevel}
pt: Nível de quantização: {quantizationLevel}
ru: Уровень квантования: {quantizationLevel}

# modelDetailsSizeText
source: Size: {size} GB
ar: الحجم: {size} جيجابايت
hi: मॉडल का आकार:
ja: サイズ: {size} GB
ko: 크기: {size} GB
pt: Texto de tamanho dos detalhes do modelo
ru: Размер модели

# modelDetailsTitle
source: {modelName} details
ar: تفاصيل {modelName}
hi: मॉडल विवरण
ja: {modelName}の詳細
ko: {modelName}의 세부 정보
pt: Título dos detalhes do modelo
ru: Название модели

# modelGeneralSettingsLabel
source: General Settings
ar: الإعدادات العامة
hi: सामान्य सेटिंग्स
ja: 一般設定
ko: 일반 설정
pt: Configurações Gerais
ru: Общие настройки

# modelIsGeneratingSnackBar
source: Model is generating
ar: النموذج قيد التوليد، يرجى الانتظار...
hi: मॉडल उत्पन्न कर रहा है...
ja: モデルを生成しています...
ko: 모델이 생성 중입니다. 잠시 기다려주세요...
pt: Modelo gerando...
ru: Модель генерирует...

# modelMiscSettingsLabel
source: Miscellaneous Settings
ar: إعدادات متنوعة للنموذج
hi: विविध सेटिंग्स
ja: その他の設定
ko: 기타 설정
pt: Configurações Diversas
ru: Разные настройки

# modelPenaltySettingsLabel
source: Penalty Settings
ar: إعدادات العقوبة للنموذج
hi: दंड सेटिंग्स
ja: ペナルティ設定
ko: 패널티 설정
pt: Configurações de Penalidade
ru: Настройки штрафов

# modelPerformanceSettingsLabel
source: Performance Settings
ar: إعدادات أداء النموذج
hi: प्रदर्शन सेटिंग्स
ja: パフォーマンス設定
ko: 성능 설정
pt: Configurações de Performance
ru: Настройки производительности

# modelPulledSuccessfullySnackBar
source: Model pulled successfully
ar: تم سحب النموذج بنجاح.
hi: मॉडल सफलतापूर्वक खींचा गया।
ja: モデルが正常に取得されました。
ko: 모델을 성공적으로 가져왔습니다.
pt: Modelo puxado com sucesso.
ru: Модель успешно получена.

# modelPushedSuccessfullySnackBar
source: Model pushed successfully
ar: تم دفع النموذج بنجاح.
hi: मॉडल सफलतापूर्वक पुश किया गया।
ja: モデルが正常にプッシュされました。
ko: 모델을 성공적으로 푸시했습니다.
pt: Modelo enviado com sucesso.
ru: Модель успешно загружена.

# modelSpecificSettingsDialogTitle
source: {modelName} settings profiles
ar: إعدادات نموذج محددة
hi: विशिष्ट मॉडल सेटिंग्स
ja: 特定のモデル設定
ko: 특정 모델 설정
pt: Configurações Específicas do Modelo
ru: Настройки конкретной модели

# modelsPageCreateButton
source: Create
ar: إنشاء نموذج
hi: मॉडल बनाएँ
ja: モデルを作成
ko: 모델 생성
pt: Criar Modelo
ru: Создать модель

# modelsPageDeleteButton
source: Delete model
ar: حذف النموذج
hi: मॉडल हटाएँ
ja: モデルを削除
ko: 모델 삭제
pt: Excluir Modelo
ru: Удалить модель

# modelsPageDeleteDialogText
source: This will delete {modelName}. Do you confirm?
ar: هل أنت متأكد أنك تريد حذف هذا النموذج؟
hi: क्या आप वास्तव में इस मॉडल को हटाना चाहते हैं?
ja: 本当にこのモデルを削除しますか？
ko: 이 모델을 정말 삭제하시겠습니까?
pt: Tem certeza que deseja excluir este modelo?
ru: Вы уверены, что хотите удалить эту модель?

# modelsPageDeleteDialogTitle
source: Delete model
ar: حذف النموذج
hi: मॉडल हटाएँ
ja: モデルの削除
ko: 모델 삭제
pt: Excluir Modelo
ru: Удалить модель

# modelsPageImportButton
source: Import
ar: استيراد نموذج
hi: मॉडल आयात करें
ja: モデルをインポート
ko: 모델 가져오기
pt: Importar modelo
ru: Кнопка Импортировать Модели

# modelsPagePullButton
source: Pull
ar: سحب
hi: खींचें
ja: プル
ko: 가져오기
pt: Puxar
ru: Кнопка Загрузить Модели

# modelsPagePushButton
source: Push
ar: دفع
hi: पुश करें
ja: プッシュ
ko: 푸시
pt: Enviar
ru: Кнопка Отправить Модели

# modelsPageRefreshButton
source: Refresh
ar: تحديث
hi: ताज़ा करें
ja: 更新
ko: 새로 고침
pt: Atualizar
ru: Обновить

# modelsPageSettingsButton
source: Open model settings
ar: إعدادات النموذج
hi: मॉडल सेटिंग्स
ja: モデル設定
ko: 모델 설정
pt: Configurações do Modelo
ru: Настройки модели

# modelsPageTitle
source: Models management
ar: النماذج
hi: मॉडल
ja: モデル
ko: 모델
pt: Modelos
ru: Название Страницы Моделей

# modifiedAtTextShared
source: Modified at: {modifiedAt}
ar: تم التعديل في:
hi: संशोधित समय:
ja: 最終更新:
ko: 최종 수정:
pt: Última modificação:
ru: Последнее изменение:

# moreOptionsButton
source: More options
ar: خيارات إضافية
hi: अधिक विकल्प
ja: さらにオプション
ko: 추가 옵션
pt: Mais Opções
ru: Дополнительные параметры

# noModelsAvailableSnackBar
source: No models available
ar: لا توجد نماذج متاحة.
hi: कोई मॉडल उपलब्ध नहीं है।
ja: 利用可能なモデルはありません。
ko: 사용 가능한 모델이 없습니다.
pt: Nenhum modelo disponível.
ru: Нет доступных моделей.

# noNeedToCreateSessionSnackBar
source: No need to create a new session
ar: لا حاجة لإنشاء جلسة جديدة.
hi: नई सत्र बनाने की आवश्यकता नहीं है।
ja: セッションを作成する必要はありません。
ko: 세션을 만들 필요가 없습니다.
pt: Não há necessidade de criar uma sessão.
ru: Нет необходимости создавать сессию.

# noUpdatesAvailableDialogTitle
source: No updates available
ar: لا توجد تحديثات متاحة
hi: कोई अपडेट उपलब्ध नहीं है
ja: 利用可能な更新はありません
ko: 사용 가능한 업데이트가 없습니다
pt: Nenhuma atualização disponível
ru: Нет доступных обновлений

# nothingToSynthesizeSnackBar
source: Nothing to synthesize
ar: لا يوجد شيء لتوليفه.
hi: सिंथेसाइज करने के लिए कुछ नहीं है।
ja: 合成するものがありません。
ko: 합성할 것이 없습니다.
pt: Nada para sintetizar.
ru: Нечего синтезировать.

source: Num. Batch
ar: عدد الدفعات
hi: बैच की संख्या
ja: バッチ数
ko: 배치 수
pt: Número de Lotes
ru: Количество партий

# numCtx
source: Context Window Size
ar: عدد السياقات
hi: संदर्भ की संख्या
ja: コンテキスト数
ko: 컨텍스트 수
pt: Número de Contextos
ru: Количество контекстов

source: Num. Keep
ar: عدد الإبقاء
hi: रखने की संख्या
ja: 保持数
ko: 유지 수
pt: Número de Manter
ru: Количество для сохранения

source: Num. Predict
ar: عدد التوقعات
hi: पूर्वानुमान की संख्या
ja: 予測数
ko: 예측 수
pt: Número de Previsões
ru: Количество предсказаний

# numThread
source: Num. Threads
ar: عدد الخيوط
hi: थ्रेड की संख्या
ja: スレッド数
ko: 스레드 수
pt: Número de Threads
ru: Количество потоков

# offlineWarningTextShared
source: You are offline
ar: تحذير: الوضع غير متصل.
hi: चेतावनी: ऑफ़लाइन मोड।
ja: 警告: オフラインモードです。
ko: 경고: 오프라인 모드입니다.
pt: Aviso: Modo offline.
ru: Предупреждение: Офлайн режим.

# ollamaDisabledGPUWarningSnackBar
source: Disabling GPU is harmful for performance
ar: تحذير: تم تعطيل GPU.
hi: चेतावनी: GPU अक्षम है।
ja: 警告: GPUが無効になっています。
ko: 경고: GPU가 비활성화되어 있습니다.
pt: Aviso: GPU desativada.
ru: Предупреждение: GPU отключена.

source: Penalize Newline
ar: معاقبة على السطر الجديد
hi: नई पंक्ति पर दंड
ja: 改行にペナルティを課す
ko: 줄 바꿈에 패널티 부여
pt: Penalizar Nova Linha
ru: Штрафовать за новую строку

source: Presence Penalty
ar: عقوبة الوجود
hi: उपस्थिति दंड
ja: 存在ペナルティ
ko: 존재 패널티
pt: Penalidade de Presença
ru: Штраф за присутствие

# privacyButton
source: Privacy
ar: إعدادات الخصوصية
hi: गोपनीयता सेटिंग्स
ja: プライバシー設定
ko: 개인정보 설정
pt: Configurações de Privacidade
ru: Настройки конфиденциальности

# progressBarStatusWithStepsText
source: Status: {status} - Step {completedSteps} of {totalSteps}
ar: الحالة: {status} - الخطوة {completedSteps} من {totalSteps}
hi: स्थिति: {status} - चरण {completedSteps} का {totalSteps}
ja: ステータス: {status} - ステップ {completedSteps} / {totalSteps} ステップ中
ko: 상태: {status} - {completedSteps}단계 중 {totalSteps}단계
pt: Progresso: {status} - Passo {completedSteps} de {totalSteps}
ru: Статус: {status} - Шаг {completedSteps} из {totalSteps}

# progressBarStatusWithTimeText
source: Status: {status} - Remaining time: {hours}:{minutes}:{seconds}
ar: الحالة: {status} - الوقت المتبقي: {hours}:{minutes}:{seconds}
hi: स्थिति: {status} - शेष समय: {hours}:{minutes}:{seconds}
ja: ステータス: {status} - 残り時間: {hours}:{minutes}:{seconds}
ko: 상태: {status} - 남은 시간: {hours}:{minutes}:{seconds}
pt: Progresso: {status} - Tempo restante: {hours}:{minutes}:{seconds}
ru: Статус: {status} - Оставшееся время: {hours}:{minutes}:{seconds}

# pullModelDialogGuideText
source: Please type the name of the model to pull:
ar: سحب النموذج:
hi: मॉडल खींचें:
ja: モデルをプル:
ko: 모델 가져오기:
pt: Puxar modelo:
ru: Получить модель:

# pullModelDialogModelNameHint
source: Type model name...
ar: أدخل اسم النموذج لسحبه
hi: मॉडल खींचने के लिए नाम दर्ज करें
ja: モデルを取得するための名前を入力してください
ko: 가져올 모델 이름을 입력하세요
pt: Digite o nome do modelo a ser puxado
ru: Введите имя модели для получения
