Repository: tangyiyong/open_local_ui
Catalog: app/assets/l10n/intl_*.arb
Languages: ar, hi, ja, ko, pt, ru

# pullModelDialogModelNameLabel
source: Model name
ar: اسم النموذج
hi: मॉडल का नाम
ja: モデル名
ko: 모델 이름
pt: Nome do Modelo
ru: Имя модели

# pullModelDialogTitle
source: Pull model
ar: سحب النموذج
hi: मॉडल खींचें
ja: モデルをプル
ko: 모델 가져오기
pt: Puxar modelo
ru: Получить модель

# pushModelDialogGuideText
source: Please select the model to push:
ar: دفع النموذج:
hi: मॉडल पुश करें:
ja: モデルをプッシュ:
ko: 모델 푸시:
pt: Enviar modelo:
ru: Отправить модель:

# pushModelDialogModelSelectorHint
source: Select model
ar: اختر النموذج للدفع
hi: पुश करने के लिए मॉडल चुनें
ja: プッシュするモデルを選択してください
ko: 푸시할 모델을 선택하세요
pt: Selecione o modelo a ser enviado
ru: Выберите модель для загрузки

# pushModelDialogTitle
source: Push model
ar: دفع النموذج
hi: मॉडल पुश करें
ja: モデルをプッシュ
ko: 모델 푸시
pt: Enviar modelo
ru: Отправить модель

# redoButtonShared
source: Redo
ar: إعادة
hi: दोबारा करें
ja: やり直し
ko: 다시 하기
pt: Refazer
ru: Повторить

source: Repeat Last N
ar: كرر آخر
hi: आखिरी को दोहराएँ
ja: 最後の を繰り返す
ko: 마지막 회 반복
pt: Repetir os últimos
ru: Повторить последние

source: Repeat Penalty
ar: عقوبة التكرار
hi: दोहराने का दंड
ja: 繰り返しペナルティ
ko: 반복 패널티
pt: Penalidade de Repetição
ru: Штраф за повторение

# resetToDefaultsButton
source: Reset to defaults
ar: إعادة تعيين إلى الافتراضات
hi: डिफ़ॉल्ट पर रीसेट करें
ja: デフォルトにリセット
ko: 기본값으로 재설정
pt: Restaurar Padrões
ru: Сбросить на стандартные

# saveButtonShared
source: Save
ar: حفظ
hi: सहेजें
ja: 保存
ko: 저장
pt: Salvar
ru: Сохранить

# searchButtonShared
source: Search
ar: بحث
hi: खोजें
ja: 検索
ko: 검색
pt: Buscar
ru: Поиск

source: Seed
ar: البذور
hi: बीज
ja: シード
ko: 시드
pt: Semente
ru: Сид

# sessionSharedSnackBar
source: Session shared
ar: تم مشاركة الجلسة.
hi: सत्र साझा किया गया।
ja: セッションが共有されました。
ko: 세션이 공유되었습니다.
pt: Sessão compartilhada.
ru: Сессия успешно поделена.

# sessionsPageClearDialogText
source: This will clear all sessions. Do you confirm?
ar: هل أنت متأكد أنك تريد مسح الجلسات؟
hi: क्या आप वास्तव में सत्रों को साफ़ करना चाहते हैं?
ja: 本当にセッションをクリアしますか？
ko: 세션을 정말 지우시겠습니까?
pt: Tem certeza que deseja limpar a sessão?
ru: Вы уверены, что хотите очистить сессию?

# sessionsPageClearDialogTitle
source: Clear sessions
ar: مسح الجلسات
hi: सत्र साफ़ करें
ja: セッションをクリア
ko: 세션 지우기
pt: Limpar Sessão
ru: Очистить сессию

# sessionsPageClearSessionsButton
source: Clear sessions
ar: مسح الجلسات
hi: सत्र साफ़ करें
ja: セッションをクリア
ko: 세션 지우기
pt: Limpar Sessões
ru: Очистить сессии

# sessionsPageCreateFolderButton
source: Create folder
ar: إنشاء مجلد
hi: फ़ोल्डर बनाएँ
ja: フォルダーを作成
ko: 폴더 생성
pt: Criar Pasta
ru: Создать папку

# sessionsPageDeleteButton
source: Delete session
ar: حذف الجلسة
hi: सत्र हटाएँ
ja: セッションを削除
ko: 세션 삭제
pt: Excluir Sessão
ru: Удалить сессию

# sessionsPageDeleteDialogText
source: This will delete {sessionName}. Do you confirm?
ar: هل أنت متأكد أنك تريد حذف هذه الجلسة؟
hi: क्या आप इस सत्र को हटाना चाहते हैं?
ja: このセッションを削除しますか？
ko: 이 세션을 삭제하시겠습니까?
pt: Deseja realmente excluir esta sessão?
ru: Вы действительно хотите удалить эту сессию?

# sessionsPageDeleteDialogTitle
source: Delete session
ar: حذف الجلسة
hi: सत्र हटाएँ
ja: セッションの削除
ko: 세션 삭제
pt: Excluir Sessão
ru: Удалить сессию

# sessionsPageEditTitleButton
source: Edit title
ar: تعديل العنوان
hi: शीर्षक संपादित करें
ja: タイトルを編集
ko: 제목 편집
pt: Editar Título
ru: Редактировать заголовок

# sessionsPageShareButton
source: Share session
ar: مشاركة الجلسة
hi: सत्र साझा करें
ja: セッションを共有
ko: 세션 공유
pt: Compartilhar Sessão
ru: Поделиться сессией

# sessionsPageTitle
source: Sessions management
ar: صفحة الجلسات
hi: सत्र पृष्ठ
ja: セッションページ
ko: 세션 페이지
pt: Página de Sessões
ru: Страница сессий

# settingsLanguageArabic
source: Arabic
ar: العربية
hi: अरबी
ja: アラビア語
ko: 아랍어
pt: Árabe
ru: Арабский

# settingsLanguageChinese
source: Chinese
ar: الصينية
hi: चीनी
ja: 中国語
ko: 중국어
pt: Chinês
ru: Китайский

# settingsLanguageEnglish
source: English
ar: الإنجليزية
hi: अंग्रेज़ी
ja: 英語
ko: 영어
pt: Inglês
ru: Английский

# settingsLanguageFrench
source: French
ar: الفرنسية
hi: फ्रेंच
ja: フランス語
ko: 프랑스어
pt: Francês
ru: Французский

# settingsLanguageGerman
source: Deutsch
ar: الألمانية
hi: जर्मन
ja: ドイツ語
ko: 독일어
pt: Alemão
ru: Немецкий

# settingsLanguageHindi
source: Indian
ar: الهندية
hi: हिंदी
ja: ヒンディー語
ko: 힌디어
pt: Hindi
ru: Хинди

# settingsLanguageItalian
source: Italian
ar: الإيطالية
hi: इतालवी
ja: イタリア語
ko: 이탈리아어
pt: Italiano
ru: Итальянский

# settingsLanguageJapanese
source: Japanese
ar: اليابانية
hi: जापानी
ja: 日本語
ko: 일본어
pt: Japonês
ru: Японский

# settingsLanguageKorean
source: Korean
ar: الكورية
hi: कोरियाई
ja: 韓国語
ko: 한국어
pt: Coreano
ru: Корейский

# settingsLanguagePortuguese
source: Portuguese
ar: البرتغالية
hi: पुर्तगाली
ja: ポルトガル語
ko: 포르투갈어
pt: Português
ru: Португальский

# settingsLanguageRussian
source: Russian
ar: الروسية
hi: रूसी
ja: ロシア語
ko: 러시아어
pt: Russo
ru: Русский

# settingsLanguageSpanish
source: Spanish
ar: الإسبانية
hi: स्पेनिश
ja: スペイン語
ko: 스페인어
pt: Espanhol
ru: Испанский

# settingsLanguageSystem
source: System
ar: لغة النظام
hi: सिस्टम की भाषा
ja: システム言語
ko: 시스템 언어
pt: Idioma do Sistema
ru: Язык системы

# settingsModelDefault
source: Default
ar: النموذج الافتراضي
hi: डिफ़ॉल्ट मॉडल
ja: デフォルトモデル
ko: 기본 모델
pt: Modelo Padrão
ru: Стандартная модель

# settingsModelOff
source: Off
ar: النموذج معطل
hi: मॉडल बंद
ja: モデルオフ
ko: 모델 꺼짐
pt: Modelo Desligado
ru: Модель выключена

# settingsModelOn
source: On
ar: النموذج مفعل
hi: मॉडल चालू
ja: モデルオン
ko: 모델 켜짐
pt: Modelo Ligado
ru: Модель включена

# settingsPageAccessibilityLabel
source: Accessibility
ar: إعدادات الوصول
hi: पहुँच सेटिंग्स
ja: アクセシビリティ設定
ko: 접근성 설정
pt: Configurações de Acessibilidade
ru: Настройки доступности

# settingsPageThemeLabel
source: Theme
ar: إعدادات السمة
hi: थीम सेटिंग्स
ja: テーマ設定
ko: 테마 설정
pt: Configurações de Tema
ru: Настройки темы

# settingsPageTitle
source: Settings
ar: إعدادات
hi: सेटिंग्स
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки

# settingsThemeModeDark
source: Dark
ar: الوضع المظلم
hi: अंधेरा मोड
ja: ダークモード
ko: 어두운 모드
pt: Modo Escuro
ru: Темный режим

# settingsThemeModeLight
source: Light
ar: الوضع الفاتح
hi: हल्का मोड
ja: ライトモード
ko: 밝은 모드
pt: Modo Claro
ru: Светлый режим

# settingsThemeModeSystem
source: System
ar: وضع النظام
hi: सिस्टम मोड
ja: システムモード
ko: 시스템 모드
pt: Modo do Sistema
ru: Режим системы

# snackBarErrorTitle
source: Error
ar: خطأ
hi: त्रुटि
ja: エラー
ko: 오류
pt: Erro
ru: Ошибка

# snackBarInfoTitle
source: Info
ar: معلومات
hi: जानकारी
ja: 情報
ko: 정보
pt: Informação
ru: Информация

# snackBarSuccessTitle
source: Success
ar: نجاح
hi: सफलता
ja: 成功
ko: 성공
pt: Sucesso
ru: Успех

# snackBarUpdateTitle
source: Update Available
ar: تحديث
hi: अपडेट
ja: 更新
ko: 업데이트
pt: Atualização
ru: Обновление

# snackBarWarningTitle
source: Warning
ar: تحذير
hi: चेतावनी
ja: 警告
ko: 경고
pt: Aviso
ru: Предупреждение

# somethingWentWrongSnackBar
source: Something went wrong
ar: حدث خطأ ما.
hi: कुछ गलत हुआ।
ja: 何かが間違いました。
ko: 문제가 발생했습니다.
pt: Ocorreu um problema.
ru: Что-то пошло не так.

# sortByDateOption
source: Date
ar: ترتيب حسب التاريخ
hi: तारीख़ के अनुसार क्रमबद्ध करें
ja: 日付でソート
ko: 날짜별 정렬
pt: Ordenar por Data
ru: Сортировать по дате

# sortByNameOption
source: Name
ar: ترتيب حسب الاسم
hi: नाम के अनुसार क्रमबद्ध करें
ja: 名前でソート
ko: 이름별 정렬
pt: Ordenar por Nome
ru: Сортировать по имени

# sortBySizeOption
source: Size
ar: ترتيب حسب الحجم
hi: आकार के अनुसार क्रमबद्ध करें
ja: サイズでソート
ko: 크기별 정렬
pt: Ordenar por Tamanho
ru: Сортировать по размеру

# sortOrderAscendingOption
source: Ascending
ar: ترتيب تصاعدي
hi: चढ़ता क्रम
ja: 昇順
ko: 오름차순
pt: Ordem Crescente
ru: По возрастанию

# sortOrderDescendingOption
source: Descending
ar: ترتيب تنازلي
hi: उतरता क्रम
ja: 降順
ko: 내림차순
pt: Ordem Decrescente
ru: По убыванию

# suggestionAddressConflictsInRelationshipsPartOne
source: Address conflicts in relationships
ar: فحص الصراعات في العلاقات.
hi: संबंधों में संघर्षों का पता लगाना।
ja: 関係の中の衝突を特定する。
ko: 관계의 충돌 해결하기.
pt: Resolver conflitos em relacionamentos.
ru: Решение конфликтов в отношениях.

# suggestionAddressConflictsInRelationshipsPartTwo
source: using effective communication
ar: تحديد الحلول الممكنة.
hi: संभावित समाधानों की पहचान करना।
ja: 潜在的な解決策を見つける。
ko: 잠재적 해결책 찾기.
pt: Encontrar soluções potenciais.
ru: Поиск потенциальных решений.

# suggestionCommonUseCasesForProblemSolvingPartOne
source: What are some common use cases
ar: استخدام التقنيات لتحسين الحلول.
hi: समस्याओं के समाधान के लिए तकनीकों का उपयोग करना।
ja: 問題解決のための一般的な使用法。
ko: 문제 해결을 위한 일반적인 사용 사례.
pt: Casos de uso comuns para resolução de problemas.
ru: Распространенные случаи использования для решения проблем.

# suggestionCommonUseCasesForProblemSolvingPartTwo
source: for problem-solving skills?
ar: مشاركة التجارب الناجحة.
hi: सफल अनुभवों को साझा करना।
ja: 成功した経験を共有する。
ko: 성공적인 경험 공유하기.
pt: Compartilhar experiências bem-sucedidas.
ru: Обмен успешным опытом.

# suggestionDecisionMakingInComplexSituationsPartOne
source: Describe the process
ar: جمع المعلومات اللازمة لاتخاذ القرار.
hi: निर्णय लेने के लिए आवश्यक जानकारी एकत्र करना।
ja: 複雑な状況での意思決定のための情報収集。
ko: 복잡한 상황에서의 의사결정 정보 수집하기.
pt: Coletar informações para tomada de decisão em situações complexas.
ru: Сбор информации для принятия решений в сложных ситуациях.

# suggestionDecisionMakingInComplexSituationsPartTwo
source: of decision-making in complex situations
ar: تحليل الخيارات المتاحة.
hi: उपलब्ध विकल्पों का विश्लेषण करना।
ja: 利用可能な選択肢の分析。
ko: 이용 가능한 선택 분석하기.
pt: Analisar opções disponíveis.
ru: Анализ доступных вариантов.

# suggestionDiscussRemoteWorkAdvantagesPartOne
source: Discuss advantages and disadvantages of remote work
ar: مناقشة مزايا العمل عن بُعد.
hi: दूरस्थ कार्य के लाभों पर चर्चा करना।
ja: リモートワークの利点について議論する。
ko: 원격 근무의 장점 논의하기.
pt: Discutir as vantagens do trabalho remoto.
ru: Обсуждение преимуществ удаленной работы.

# suggestionDiscussRemoteWorkAdvantagesPartTwo
source: for employees and employers
ar: استعراض التجارب الشخصية.
hi: व्यक्तिगत अनुभवों की समीक्षा करना।
ja: 個々の体験をレビューする。
ko: 개별 경험 검토하기.
pt: Revisar experiências individuais.
ru: Обзор индивидуального опыта.

# suggestionDistinguishTeachingAndMentoringPartOne
source: Distinguish between teaching and mentoring
ar: تحديد الفروقات بين التدريس والإرشاد.
hi: शिक्षण और मार्गदर्शन के बीच भेद करना।
ja: 教育とメンタリングの違いを理解する。
ko: 교육과 멘토링의 차이 이해하기.
pt: Entender a diferença entre ensino e mentoria.
ru: Понимание различий между обучением и наставничеством.

# suggestionDistinguishTeachingAndMentoringPartTwo
source: and their benefits
ar: تطوير مهارات الإرشاد.
hi: मार्गदर्शन कौशल विकसित करना।
ja: メンタリングスキルを育成する。
ko: 멘토링 기술 개발하기.
pt: Desenvolver habilidades de mentoria.
ru: Развитие навыков наставничества.

# suggestionEvaluateTeamPerformancePartOne
source: Evaluate the performance of a team
ar: تقييم أداء الفريق بشكل دوري.
hi: टीम के प्रदर्शन का नियमित रूप से मूल्यांकन करना।
ja: チームのパフォーマンスを定期的に評価する。
ko: 팀 성과 정기적으로 평가하기.
pt: Avaliar regularmente o desempenho da equipe.
ru: Регулярная оценка производительности команды.

# suggestionEvaluateTeamPerformancePartTwo
source: using teamwork metrics
ar: تقديم ملاحظات بناءة.
hi: निर्माणात्मक फीडबैक प्रदान करना।
ja: 建設的なフィードバックを提供する。
ko: 건설적인 피드백 제공하기.
pt: Fornecer feedback construtivo.
ru: Предоставление конструктивной обратной связи.

# suggestionExplainEmpathySignificancePartOne
source: Explain the significance of empathy
ar: شرح أهمية التعاطف في العمل.
hi: काम में सहानुभूति के महत्व को समझाना।
ja: 仕事における共感の重要性を説明する。
ko: 업무에서 공감의 중요성 설명하기.
pt: Explicar a importância da empatia no trabalho.
ru: Объяснение важности эмпатии в работе.

# suggestionExplainEmpathySignificancePartTwo
source: in building strong connections
ar: تطبيق التعاطف في التعامل مع الآخرين.
hi: अन्य लोगों के साथ सहानुभूति लागू करना।
ja: 他者と共感を持つことを実践する。
ko: 타인과 공감하기 실천하기.
pt: Praticar a empatia com os outros.
ru: Практика эмпатии к другим.

# suggestionExplainLearningFromExperiencePartOne
source: Explain the concept of learning from experience
ar: توضيح كيفية التعلم من التجارب.
hi: अनुभव से सीखने के तरीके को स्पष्ट करना।
ja: 経験から学ぶ方法を説明する。
ko: 경험으로부터 학습하는 방법 설명하기.
pt: Explicar como aprender com a experiência.
ru: Объяснение того, как учиться на опыте.

# suggestionExplainLearningFromExperiencePartTwo
source: using everyday situations
ar: تشجيع مشاركة المعرفة.
hi: ज्ञान साझा करने को प्रोत्साहित करना।
ja: 知識の共有を奨励する。
ko: 지식 공유 촉진하기.
pt: Promover o compartilhamento de conhecimento.
ru: Стимулирование обмена знаниями.

# suggestionHandleDailyStressPartOne
source: Handle stress in daily life
ar: استراتيجيات التعامل مع الضغط اليومي.
hi: दैनिक तनाव से निपटने की रणनीतियाँ।
ja: 日常的なストレスへの対処法。
ko: 일상 스트레스 처리 방법.
pt: Estratégias para lidar com o estresse diário.
ru: Стратегии для справления с ежедневным стрессом.

# suggestionHandleDailyStressPartTwo
source: with effective coping strategies
ar: تنظيم الوقت بفعالية.
hi: प्रभावी समय प्रबंधन।
ja: 効果的な時間管理。
ko: 효과적인 시간 관리.
pt: Gerenciamento eficaz do tempo.
ru: Эффективное управление временем.

# suggestionImportanceOfCommunicationPartOne
source: Understand the importance of communication
ar: أهمية التواصل الفعال في الفريق.
hi: टीम में प्रभावी संचार का महत्व।
ja: チーム内での効果的なコミュニケーションの重要性。
ko: 팀 내 효과적인 커뮤니케이션 중요성.
pt: A importância da comunicação eficaz dentro da equipe.
ru: Важность эффективной коммуникации в команде.

# suggestionImportanceOfCommunicationPartTwo
source: in personal and professional life
ar: تجنب سوء الفهم.
hi: गलतफहमी से बचना।
ja: 誤解を避ける。
ko: 오해 방지하기.
pt: Evitar mal-entendidos.
ru: Избегание недопонимания.

# suggestionPersonalGrowthChallengesPartOne
source: List some challenges
ar: تحديد تحديات النمو الشخصي.
hi: व्यक्तिगत विकास की चुनौतियों की पहचान करना।
ja: 個人の成長の課題を特定する。
ko: 개인 성장의 도전 과제 식별하기.
pt: Identificar desafios de crescimento pessoal.
ru: Идентификация проблем роста личности.

# suggestionPersonalGrowthChallengesPartTwo
source: in personal growth
ar: تطوير خطة لتحقيق الأهداف.
hi: लक्ष्यों को प्राप्त करने की योजना विकसित करना।
ja: 目標達成の計画を立てる。
ko: 목표 달성 계획 세우기.
pt: Definir metas para alcançá-las.
ru: Определение целей для их достижения.

# suggestionPlanSurpriseBirthdayPartyPartOne
source: Plan a birthday party
ar: خطط لحفلة عيد ميلاد مفاجئة.
hi: सरप्राइज बर्थडे पार्टी की योजना बनाना।
ja: サプライズ誕生日パーティーの計画を立てる。
ko: 서프라이즈 생일 파티 계획하기.
pt: Planejar uma festa de aniversário surpresa.
ru: Планирование вечеринки-сюрприза на день рождения.

# suggestionPlanSurpriseBirthdayPartyPartTwo
source: for your best friend with a surprise element
ar: تحديد الأنشطة والضيوف.
hi: गतिविधियों और मेहमानों की पहचान करना।
ja: アクティビティとゲストを特定する。
ko: 활동과 게스트 식별하기.
pt: Identificar atividades e convidados.
ru: Определение мероприятий и гостей.

# systemPromptTextFieldLabel
source: System Prompt:
ar: نص النظام
hi: सिस्टम टेक्स्ट
ja: システムテキスト
ko: 시스템 텍스트
pt: Texto do Sistema
ru: Текст системы

source: Temperature
ar: الحرارة
hi: तापमान
ja: 温度
ko: 온도
pt: Temperatura
ru: Температура

source: topK
ar: أفضل K
hi: सर्वोत्तम K
ja: トップK
ko: 상위 K

source: topP
ar: أفضل P
hi: सर्वोत्तम P
ja: トップP
ko: 상위 P

# totalOnDiskSizeLabel
source: Total on disk: {size}
ar: إجمالي الحجم على القرص
hi: डिस्क पर कुल आकार
ja: ディスク上の合計サイズ
ko: 디스크 상의 총 크기
pt: Tamanho Total em Disco
ru: Общий размер на диске

source: typicalP
ar: P نموذجي
hi: सामान्य P
ja: 典型的なP
ko: 전형적인 P
pt: P Típico
ru: Типичный P

# undoButtonShared
source: Undo
ar: تراجع
hi: पूर्ववत करें
ja: 元に戻す
ko: 되돌리기
pt: Desfazer
ru: Отменить

# updateAvailableDialogTitle
source: Update available
ar: تحديث متاح
hi: अपडेट उपलब्ध है
ja: 更新が利用可能
ko: 업데이트 가능
pt: Atualização Disponível
ru: Доступно обновление

# updateAvailableSnackBar
source: Update available
ar: تحديث متاح
hi: अपडेट उपलब्ध है
ja: 更新が利用可能
ko: 업데이트 가능
pt: Atualização disponível
ru: Обновление доступно

# updateButton
source: Update
ar: تحديث الآن
hi: अभी अपडेट करें
ja: 今すぐ更新
ko: 지금 업데이트
pt: Atualizar Agora
ru: Обновить сейчас

# updateDialogText1
source: Do you want to get the latest version now?
ar: هناك تحديث متاح.
hi: एक अपडेट उपलब्ध है।
ja: 更新が利用可能です。
ko: 업데이트가 가능합니다.
pt: Uma atualização está disponível.
ru: Доступно обновление.

# updateDialogText2
source: No updates available at the moment
ar: هل ترغب في التحديث الآن؟
hi: क्या आप अभी अपडेट करना चाहते हैं?
ja: 今すぐ更新しますか？
ko: 지금 업데이트 하시겠습니까?
pt: Deseja atualizar agora?
ru: Вы хотите обновить сейчас?

# updateInProgressPageDescription
source: Please wait for the installer to come up and follow the instructions
ar: التحديث جارٍ، يرجى الانتظار.
hi: अपडेट हो रहा है, कृपया प्रतीक्षा करें।
ja: 更新中です。しばらくお待ちください。
ko: 업데이트 중입니다. 잠시 기다려 주세요.
pt: Atualizando. Por favor, aguarde.
ru: Идет обновление. Пожалуйста, подождите.

# updateInProgressPageTitle
source: Update in progress
ar: جارٍ تحديث...
hi: अपडेट हो रहा है...
ja: 更新中...
ko: 업데이트 진행 중...
pt: Atualização em Andamento...
ru: Обновление в процессе...

source: Use Mlock
ar: استخدام Mlock
hi: Mlock का उपयोग करें
ja: Mlockを使用
ko: Mlock 사용
pt: Usar Mlock
ru: Использовать Mlock

source: Use Mmap
ar: استخدام Mmap
hi: Mmap का उपयोग करें
ja: Mmapを使用
ko: Mmap 사용
pt: Usar Mmap
ru: Использовать Mmap

source: Vocab Only
ar: المفردات فقط
hi: केवल शब्दावली
ja: 語彙のみ
ko: 어휘만
pt: Apenas Vocabulário
ru: Только словарь
